counseling/app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = ?  [["user_id", 21]]
---
  def index
    @appointments = current_user.appointments.all

INSERT INTO "appointments" ("date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["date", nil], ["user_id", 21], ["created_at", "2024-11-26 02:25:19.883758"], ["updated_at", "2024-11-26 02:25:19.883758"]]
---
  def create
    @appointment = Appointment.new(appointment_params)
    @appointment.user = current_user
    if @appointment.save

UPDATE "appointments" SET "date" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["date", "2024-12-13"], ["updated_at", "2024-11-26 02:44:50.436747"], ["id", 2]]
---
  def update
    if @appointment.update(appointment_params)

SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = ? AND "appointments"."id" = ? LIMIT ?  [["user_id", 21], ["id", 1], ["LIMIT", 1]]
---
  def load_appointment
    @appointment = current_user.appointments.find(params[:id])