counseling/app/controllers/authentications_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? ORDER BY "users"."id" ASC LIMIT ?  [["uid", "114194640"], ["provider", "github"], ["LIMIT", 1]]
---
  def create
    #render json: user_hash
    @user = User.where(uid: user_hash[:uid], provider: user_hash[:provider]).first