counseling/app/controllers/books_controller.rb

  def index
    @books = current_user.books.all
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 12]]

  def create
    @book = Book.new(book_params)
    @book.user = current_user
    if @book.save
---
INSERT INTO "books" ("title", "author", "description", "published_date", "price", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "Leo wong"], ["updated_at", "2024-10-18 18:36:31.522394"], ["id", 1]]

  def load_book
    @book = current_user.books.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 13], ["id", 2], ["LIMIT", 1]]