counseling/app/controllers/counselors_controller.rb

  def index
    @counselors = Counselor.all
---
SELECT "counselors".* FROM "counselors"

  def create
    @counselor = Counselor.new(counselor_params)

    if @counselor.save
---
INSERT INTO "counselors" ("first_name", "last_name", "specialization", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @counselor.update(counselor_params)
---
UPDATE "counselors" SET "specialization" = ?, "updated_at" = ? WHERE "counselors"."id" = ?  [["specialization", "Psychiatrist"], ["updated_at", "2024-10-26 00:32:15.772012"], ["id", 1]]

  def destroy
    @counselor.destroy
---
DELETE FROM "counselors" WHERE "counselors"."id" = ?  [["id", 2]]

  def load_counselor
    @counselor = Counselor.find(params[:id])
---
SELECT "counselors".* FROM "counselors" WHERE "counselors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]