counseling/app/controllers/sessions_controller.rb

SELECT "counselors".* FROM "counselors" WHERE "counselors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_counselor
    @counselor = Counselor.find(params[:counselor_id])