counseling/app/controllers/tasks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
  def create
    @user = User.where(email: params[:email]).first