counseling/app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = ?, "last_name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Host "], ["last_name", "host "], ["email", "[FILTERED]"], ["updated_at", "2024-11-14 22:46:01.467246"], ["id", 19]]
---
  def update_password
    @user = current_user
    if @user.has_password?
      if @user.authenticate(params[:user][:current_password]) && @user.update(user_params.except(:current_password))
        # Manually reset the session
        session[:user_id] = @user.id
        redirect_to root_path, notice: "Password updated successfully"
      else
        flash.now[:alert] = "Current password is incorrect or new password is invalid"
        render :edit
      end
    else
      if @user.update(user_params.except(:current_password, :password, :password_confirmation))

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 19]]
---
  def destroy
    logout if current_user == @user
    @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  def load_user
    @user = User.find(params[:id])