counseling/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "[FILTERED]"], ["updated_at", "2024-11-09 02:43:20.879978"], ["id", 11]]

  def update_password
    @user = current_user

    if @user.authenticate(params[:user][:current_password]) && @user.update(user_params.except(:current_password))
---
UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "Will"], ["updated_at", "2024-11-09 08:48:26.022780"], ["id", 13]]

  def destroy
    logout if current_user == @user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 17]]

  def load_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]